src/Catalogs/дкл_НастройкиСкладовЛифтов/дкл_НастройкиСкладовЛифтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>дкл_НастройкиСкладовЛифтов</name>
  <attributes>
    <name>machineId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтодобавлениеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтопереводОрдеровВСтатусReady</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМеханики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАСХ</name>
    <type>
      <types>EnumRef.дкл_ВидыАСХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗонВыдачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоположениеWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоУстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОповещений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.дкл_СпособПодключения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиОповещений</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПолки</name>
    <attributes>
      <name>trayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>title</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>width</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>depth</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>weight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>barcode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ярус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/дкл_ОбщегоНазначенияПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция АдресАСХ(НастройкаСклада) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСклада, "Адрес");
	
КонецФункции // ()

Функция СоздатьПрокси(Интерфейс, МестоположениеWSDL, Адрес, Таймаут) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Определение = Новый WSОпределения(МестоположениеWSDL, , , ,Таймаут);  
	Исключение                                                                
		// почему-то не срабатывает с 1-го раза...
		Попытка
			Определение = Новый WSОпределения(МестоположениеWSDL, , , ,Таймаут);  
		Исключение
			Возврат ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецПопытки;
	
	Попытка
		
		Сервис = Определение.Сервисы.Получить("http://www.dikom.ru/lift/integration/services/", Интерфейс);
		ИмяТочкиПодключения = Сервис.ТочкиПодключения[0].Имя;       
		
		Прокси = Новый WSПрокси(Определение, 
		"http://www.dikom.ru/lift/integration/services/",
		Интерфейс, ИмяТочкиПодключения,,Таймаут,,
		Адрес + "/lift/integration/services/" + Интерфейс);         
		
		
	Исключение                                                   
		
		Возврат ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат Прокси;
	
КонецФункции // ()

Функция Перевод(Текст) Экспорт 
	
	Результат = "";
	
	Если Текст = "PRELOADING" Тогда
		Результат = "предварительная загрузка";	
	ИначеЕсли Текст = "READY_TO_LOAD" Тогда
		Результат = "готово к загрузке"; 
	ИначеЕсли Текст = "LOADING" Тогда
		Результат = "загрузка"; 
	ИначеЕсли Текст = "READY_TO_UNLOAD" Тогда      
		Результат = "готово к выгрузке"; 
	ИначеЕсли Текст = "UNLOADING" Тогда
		Результат = "выгрузка"; 
	ИначеЕсли Текст = "PAUSE" Тогда
		Результат = "пауза"; 
	ИначеЕсли Текст = "COMPLETED" Тогда
		Результат = "выполнено"; 
	ИначеЕсли Текст = "NOT_STARTED" Тогда         
		Результат = "не начато"; 
	ИначеЕсли Текст = "PARTLY_DONE" Тогда      
		Результат = "частично выполнено"; 
	ИначеЕсли Текст = "INSUFFICIENCY" Тогда         
		Результат = "недостаточно"; 
	ИначеЕсли Текст = "NO_SPACE" Тогда
		Результат = "нет места";
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции // ()

Функция ЭтоСкладЛифт(Склад) Экспорт
	// может вызываться из основной конфигурации для условной настройки форм...
	Возврат Справочники.дкл_НастройкиСкладовЛифтов.ЭтоСкладЛифт(Склад);
КонецФункции // ()

Функция БуквенныйКодСтатусаЛифта(Код) Экспорт
	
	// коды                         
	// === в работе ===
	// 0 - АСХ находится в состоянии покоя.
	// 1 - Выполняется операция. 
	// === в работе ===
	// 2 - Есть неполадки, мешающие работе АСХ.
	// (теперь нужен код, т.к. надо отображать все состояния)

	Если Код = 0 Тогда
		Возврат "RDY";
	ИначеЕсли Код = 1 Тогда
		Возврат "MOV";
	ИначеЕсли Код > 1 Тогда
		Возврат "ERR";
	КонецЕсли;
	
КонецФункции

Функция БуквенныйКодСтатусаОперациииСПолкой(Код) Экспорт
	
	// 0- выполнено.
	// 1- выполняется.
	// 2 - Техническая ошибка (поломка) в Лифте.
	// 3 - Ошибка в API и передаваемых запросах.
	// 4. АСХ занят выполнением другой операции.
	// 5- Превышены допустимые характеристики груза (вес, высота).
	// 6- Тайм-аут. Подвисший запрос.	
	
	Если Код = 0 Тогда
		Возврат "RDY";
	ИначеЕсли Код = 1 Тогда
		Возврат "MOV";
	ИначеЕсли Код > 1 Тогда
		Возврат "ERR";
	КонецЕсли;
	
КонецФункции


#КонецОбласти
